{
  "requestUrl": "/api/articles",
  "contentType": "application/json",
  "statusCode": 200,
  "data": {
    "articles": [
      {
        "id": "1",
        "title": "Backbone codebase",
        "name": "Gavin Jayson",
        "text": "Austin master cleanse Pitchfork Vice. McSweeney's Marfa shabby chic synth 90's pop-up blog normcore iPhone, try-hard post-ironic semiotics 3 wolf moon vinyl. Leggings yr brunch iPhone, trust fund four loko chia meggings narwhal plaid sartorial kale chips Wes Anderson cray. Tumblr cred banjo, selvage meditation keffiyeh Vice trust fund sartorial McSweeney's. You probably haven't heard of them flannel wolf biodiesel lomo. Seitan ethical tilde, street art fashion axe mlkshk food truck freegan kitsch. McSweeney's Kickstarter typewriter, readymade tofu small batch aesthetic normcore lomo selvage shabby chic.",
        "avatar": "http://localhost:8000/images/avatar.png",
        "comments_count": 6
      },
      {
        "id": "2",
        "title": "Marionette cookbook",
        "name": "Gavin Jayson",
        "text": "Normcore literally ethical, pickled keytar migas crucifix 90's mixtape Tumblr wolf chillwave narwhal. Stumptown bicycle rights listicle mixtape. Drinking vinegar four loko selfies art party. Tumblr selfies paleo, listicle Williamsburg Helvetica food truck slow-carb dreamcatcher pour-over American Apparel. Narwhal tote bag readymade mumblecore, mixtape Marfa seitan. Bespoke biodiesel typewriter normcore, four loko PBR&B quinoa. Bitters leggings skateboard, four loko squid crucifix beard Carles Truffaut selfies wolf.",
        "avatar": "http://localhost:8000/images/avatar.png",
        "comments_count": 8
      },
      {
        "id": "3",
        "title": "CoffeeScript syntax",
        "name": "Gavin Jayson",
        "text": "Et Portland 3 wolf moon, Shoreditch iPhone id disrupt aesthetic drinking vinegar keytar dreamcatcher. Pour-over elit butcher locavore, laboris four dollar toast cliche veniam Marfa. Chillwave artisan butcher kale chips salvia id. Vinyl kitsch placeat, butcher umami cold-pressed YOLO ugh iPhone cornhole minim beard laboris tilde. Synth mollit dreamcatcher Wes Anderson 90's, meditation Austin +1 forage ethical cray ex small batch McSweeney's. Put a bird on it Brooklyn selfies, Helvetica delectus tote bag tilde Shoreditch. Master cleanse plaid est brunch culpa, hashtag post-ironic.",
        "avatar": "http://localhost:8000/images/avatar.png",
        "comments_count": 12
      }
    ],
    "meta": {
      "pagination": {
        "page": 1,
        "per_page": 10,
        "total": 3
      }
    }
  }
}
